src/DocumentJournals/УчетРабочегоВремени/УчетРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>УчетРабочегоВремени</name>
  <registeredDocuments>Document.ЕжедневныйОтчет</registeredDocuments>
  <registeredDocuments>Document.ЕженедельныйОтчет</registeredDocuments>
  <columns>
    <name>ДлительностьРабот</name>
  </columns>
  <columns>
    <name>ДлительностьРабочая</name>
  </columns>
  <columns>
    <name>НекорректнаяДлительность</name>
  </columns>
  <columns>
    <name>Подразделение</name>
  </columns>
  <columns>
    <name>Пользователь</name>
  </columns>
</mdclass:DocumentJournal>

src/Documents/ЕжедневныйОтчет/ЕжедневныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЕжедневныйОтчет</name>
  <registerRecords>AccumulationRegister.РабочееВремяПользователей</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьРабочая</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДня</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НекорректнаяДлительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеДня</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособУказанияВремени</name>
    <type>
      <types>EnumRef.СпособыУказанияВремени</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьРаботы</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.Проекты</types>
        <types>DocumentRef.ВходящееПисьмо</types>
        <types>TaskRef.ЗадачаИсполнителя</types>
        <types>DocumentRef.ИсходящееПисьмо</types>
        <types>CatalogRef.Файлы</types>
        <types>CatalogRef.ВходящиеДокументы</types>
        <types>CatalogRef.ВнутренниеДокументы</types>
        <types>DocumentRef.ЕжедневныйОтчет</types>
        <types>CatalogRef.ИсходящиеДокументы</types>
        <types>CatalogRef.Мероприятия</types>
        <types>CatalogRef.ПроектныеЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Начало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Окончание</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектнаяЗадача</name>
      <type>
        <types>CatalogRef.ПроектныеЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СозданаАвтоматически</name>
      <comment>Создана автоматически при выполнении задачи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЕженедельныйОтчет/ЕженедельныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЕженедельныйОтчет</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.РабочееВремяПользователей</registerRecords>
  <attributes>
    <name>ДлительностьРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьРабочая</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Достижения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Неудачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Планы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДниНедели</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня</name>
      <type>
        <types>EnumRef.ВидыДней</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДня</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеДня</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕжедневныйОтчет</name>
      <type>
        <types>DocumentRef.ЕжедневныйОтчет</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьРабочая</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сб</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вс</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пн</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ср</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Чт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектнаяЗадача</name>
      <type>
        <types>CatalogRef.ПроектныеЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.Проекты</types>
        <types>DocumentRef.ВходящееПисьмо</types>
        <types>TaskRef.ЗадачаИсполнителя</types>
        <types>DocumentRef.ИсходящееПисьмо</types>
        <types>CatalogRef.ЗаписиРабочегоКалендаря</types>
        <types>CatalogRef.Файлы</types>
        <types>CatalogRef.ВходящиеДокументы</types>
        <types>CatalogRef.ВнутренниеДокументы</types>
        <types>DocumentRef.ЕжедневныйОтчет</types>
        <types>CatalogRef.ИсходящиеДокументы</types>
        <types>CatalogRef.Мероприятия</types>
        <types>CatalogRef.ПроектныеЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЯзыка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.ТерриторииИПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВДокументах</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПереписке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПерепискеСРангом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>105</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенныеВебСерверы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DocumentJournals/УчетРабочегоВремени/Forms/ЖурналОтчетовПодчиненных/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаОтбора = ТекущаяДатаСеанса();
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Подразделение = РаботаСПользователями.ПолучитьПодразделение(
			Пользователи.ТекущийПользователь());
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокОтчетов,
			"Подразделение", Подразделение);
		ОбновитьОтчетыСервер();
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЕжедневныеОтчеты") Тогда
		Элементы.ОтчетыВсегоЗаДень.Видимость = Ложь;
		Элементы.ОтчетыРабочееЗаДень.Видимость = Ложь;
		Элементы.ОтчетыПроцентФондаЗаДень.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЕженедельныеОтчеты") Тогда
		Элементы.ОтчетыВсегоЗаНеделю.Видимость = Ложь;
		Элементы.ОтчетыРабочееЗаНеделю.Видимость = Ложь;
		Элементы.ОтчетыПроцентФондаЗаНеделю.Видимость = Ложь;
	КонецЕсли;
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Пользователь = Пользователи.ТекущийПользователь();
		МассивПодразделений = 
			ЖурналыДокументов.УчетРабочегоВремени.МассивПодразделенийДляПросмотраОтчетовОТрудозатратах(
			Пользователь);
		ДоступныеПодразделения.ЗагрузитьЗначения(МассивПодразделений);
	КонецЕсли;

	Если ДоступныеПодразделения.Количество() = 1 Тогда
		Подразделение = ДоступныеПодразделения[0].Значение;
		Элементы.Подразделение.Видимость = Ложь;
	КонецЕсли;

	Если ДоступныеПодразделения.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОтчетов,
			"Подразделение", ДоступныеПодразделения);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокОтчетов, "Пользователь",
		Пользователи.ТекущийПользователь());
		
	ЭтоМобильныйКлиент = ПараметрыСеанса.ЭтоМобильныйКлиент;
	МК_НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	Если Не ЗначениеЗаполнено(Настройки["Подразделение"]) Тогда
		Подразделение = РаботаСПользователями.ПолучитьПодразделение(
			Пользователи.ТекущийПользователь());
	КонецЕсли;
	
	Если ДоступныеПодразделения.Количество() И ЗначениеЗаполнено(Подразделение)
		И ДоступныеПодразделения.НайтиПоЗначению(Подразделение) = Неопределено Тогда
		Подразделение = Неопределено;
	КонецЕсли;
	
	Если ДоступныеПодразделения.Количество() = 1 Тогда
		Подразделение = ДоступныеПодразделения[0].Значение;
		Элементы.Подразделение.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокОтчетов,
			"Подразделение",
			Подразделение);
		ОбновитьОтчетыСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзмененЕженедельныйОтчет"
		Или ИмяСобытия = "ИзмененЕжедневныйОтчет" Тогда
		ОбновитьОтчеты();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокОтчетов,
		"Подразделение",
		Подразделение);
	ОбновитьОтчеты();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ДоступныеПодразделения.Количество() 
		И ДоступныеПодразделения.НайтиПоЗначению(ВыбранноеЗначение) = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		СообщениеОбОшибке = СтрШаблон(НСтр("ru = 'У вас нет прав на просмотр отчетов по подразделению %1.'"),
			ВыбранноеЗначение);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке, , "Подразделение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ДоступныеПодразделения.Количество() Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("ДоступныеПодразделения", ДоступныеПодразделения);
		ОткрытьФорму("Справочник.СтруктураПредприятия.ФормаВыбора", ПараметрыФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтбораПриИзменении(Элемент)
	ОбновитьОтчеты();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыПриАктивизацииСтроки(Элемент)
	Если Элементы.Отчеты.ТекущиеДанные = Неопределено Тогда
		ТекущийПользователь = Неопределено;
	Иначе
		ТекущийПользователь = Элементы.Отчеты.ТекущиеДанные.Пользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ОтчетыВсегоЗаДень"
		Или Поле.Имя = "ОтчетыРабочееЗаДень"
		Или Поле.Имя = "ОтчетыПроцентФондаЗаДень" Тогда
		СтандартнаяОбработка = Ложь;
		Отчет = Элементы.Отчеты.ТекущиеДанные.ЕжедневныйОтчет;
		Если ЗначениеЗаполнено(Отчет) Тогда
			ПоказатьЗначение(, Отчет);
		Иначе
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура);
			ПараметрыФормы.ЗначенияЗаполнения.Вставить("Пользователь", 
				Элементы.Отчеты.ТекущиеДанные.Пользователь);
			ПараметрыФормы.ЗначенияЗаполнения.Вставить("Дата", 
				ДатаОтбора);
			ОткрытьФорму("Документ.ЕжедневныйОтчет.Форма.ФормаДокумента",
				ПараметрыФормы,
				Элемент);
		КонецЕсли;
	КонецЕсли;
		
	Если Поле.Имя = "ОтчетыВсегоЗаНеделю"
		Или Поле.Имя = "ОтчетыРабочееЗаНеделю"
		Или Поле.Имя = "ОтчетыПроцентФондаЗаНеделю" Тогда
		СтандартнаяОбработка = Ложь;
		Отчет = Элементы.Отчеты.ТекущиеДанные.ЕженедельныйОтчет;
		Если ЗначениеЗаполнено(Отчет) Тогда
			ПоказатьЗначение(, Отчет);
		Иначе
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура);
			ПараметрыФормы.ЗначенияЗаполнения.Вставить("Пользователь", 
				Элементы.Отчеты.ТекущиеДанные.Пользователь);
			ПараметрыФормы.ЗначенияЗаполнения.Вставить("Дата", 
				ДатаОтбора);
			ОткрытьФорму("Документ.ЕженедельныйОтчет.Форма.ФормаДокумента",
				ПараметрыФормы,
				Элемент);
		КонецЕсли;
	КонецЕсли;
	
	Если Поле.Имя = "Отсутствие" Тогда
		СтандартнаяОбработка = Ложь;
		Отсутствие = Элементы.Отчеты.ТекущиеДанные.Отсутствие;
		Если ЗначениеЗаполнено(Отсутствие) Тогда
			ПоказатьЗначение(, Отсутствие);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыОбработкаЗапросаОбновления()
	
	ОбновитьОтчетыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДатаОтбораПриАктивизацииДаты(Элемент)
	
	Элементы.ДатаОтбора.Видимость = Ложь;
	Элементы.ДатаОтбораПолеВвода.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДатаОтбораПолеВводаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.ДатаОтбора.Видимость = Истина;
	Элементы.ДатаОтбораПолеВвода.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтчетовПриАктивизацииСтроки(Элемент)
	Если Элементы.СписокОтчетов.ТекущиеДанные = Неопределено Тогда
		ТекущийПользователь = Неопределено;
	Иначе
		ТекущийПользователь = Элементы.СписокОтчетов.ТекущиеДанные.Пользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаПоДатам Тогда
		Если Элементы.Отчеты.ТекущиеДанные = Неопределено Тогда
			ТекущийПользователь = Неопределено;
		Иначе
			ТекущийПользователь = Элементы.Отчеты.ТекущиеДанные.Пользователь;
		КонецЕсли;
	КонецЕсли;
	Если ТекущаяСтраница = Элементы.СтраницаСписком Тогда
		Если Элементы.СписокОтчетов.ТекущиеДанные = Неопределено Тогда
			ТекущийПользователь = Неопределено;
		Иначе
			ТекущийПользователь = Элементы.СписокОтчетов.ТекущиеДанные.Пользователь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	ПриИзмененииПараметровЭкранаНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьОтчеты()
	ОбновитьОтчетыСервер();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтчетыСервер()
	
	ТаблицаОтчетов.Очистить();
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат;
	КонецЕсли;
	
	ПользователиПодразделения = РаботаСПользователями.ПолучитьПользователейПодразделения(Подразделение);
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПользователиПодразделения,
		Пользователи.ТекущийПользователь());
	
	ПолучатьОтсутствия = ПолучитьФункциональнуюОпцию("ИспользоватьОтсутствия");
	Если ПолучатьОтсутствия Тогда
		НастройкиОтсутствий = ОтсутствияКлиентСервер.НастройкиПроверкиОтсутствий();
		НастройкиОтсутствий.УчитыватьФлагБудуРазбиратьЗадачи = Ложь;
		ТаблицаОтсутствий = Отсутствия.ПолучитьТаблицуОтсутствий(НачалоДня(ДатаОтбора),
			КонецДня(ДатаОтбора),
			ПользователиПодразделения,
			НастройкиОтсутствий);
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Ссылка КАК Пользователь,
		|	ЕжедневныйОтчет.Ссылка КАК ЕжедневныйОтчет,
		|	ЕжедневныйОтчет.ДлительностьРабот КАК ЕжедневныйОтчетДлительностьРабот,
		|	ЕжедневныйОтчет.ДлительностьРабочая КАК ЕжедневныйОтчетДлительностьРабочая,
		|	ЕженедельныйОтчет.Ссылка КАК ЕженедельныйОтчет,
		|	ЕженедельныйОтчет.ДлительностьРабот КАК ЕженедельныйОтчетДлительностьРабот,
		|	ЕженедельныйОтчет.ДлительностьРабочая КАК ЕженедельныйОтчетДлительностьРабочая
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЕжедневныйОтчет КАК ЕжедневныйОтчет
		|		ПО (ЕжедневныйОтчет.Пользователь = Пользователи.Ссылка)
		|			И (НЕ ЕжедневныйОтчет.ПометкаУдаления)
		|			И (ЕжедневныйОтчет.Дата МЕЖДУ &НачалоДня И &КонецДня)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЕженедельныйОтчет КАК ЕженедельныйОтчет
		|		ПО (ЕженедельныйОтчет.Пользователь = Пользователи.Ссылка)
		|			И (НЕ ЕженедельныйОтчет.ПометкаУдаления)
		|			И (ЕженедельныйОтчет.Дата МЕЖДУ &НачалоНедели И &КонецНедели)
		|ГДЕ
		|	Пользователи.Ссылка В (&ПользователиПодразделения)
		|УПОРЯДОЧИТЬ ПО
		|	Пользователь");
	Запрос.УстановитьПараметр("ПользователиПодразделения", ПользователиПодразделения);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ДатаОтбора));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ДатаОтбора));
	
	Если ДеньНедели(ДатаОтбора) > 5 Тогда 
		НачалоНедели = УчетВремениКлиентСервер.КонецВоскресенья(ДатаОтбора) + 1 - 3600 * 24 * 2;
		КонецНедели = УчетВремениКлиентСервер.КонецВоскресенья(
			УчетВремениКлиентСервер.КонецВоскресенья(ДатаОтбора) + 1) - 3600 * 24 * 2;
	Иначе
		НачалоНедели = УчетВремениКлиентСервер.НачалоПонедельника(ДатаОтбора) - 3600 * 24 * 2;
		КонецНедели = УчетВремениКлиентСервер.КонецВоскресенья(ДатаОтбора) - 3600 * 24 * 2;
	КонецЕсли;
	Запрос.УстановитьПараметр("НачалоНедели", НачалоНедели);
	Запрос.УстановитьПараметр("КонецНедели", КонецНедели);
	
	ПользователиМассивом = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПользователиМассивом.Добавить(Выборка.Пользователь);
	КонецЦикла;
	
	// Соберем длительность за день.
	Фонд = УчетВремени.ФондРабочегоВремени(ПользователиМассивом, НачалоНедели, КонецНедели);
	Фонд.Колонки.Длительность.Имя = "ДлительностьЗаНеделю";
	Фонд.Колонки.Добавить("ДлительностьЗаДень", Новый ОписаниеТипов("Число"));
	Для Каждого СтрокаФонда Из Фонд Цикл
		Если СтрокаФонда.ДатаОкончания < НачалоДня(ДатаОтбора)
			Или СтрокаФонда.ДатаНачала > КонецДня(ДатаОтбора) Тогда
			Продолжить;
		КонецЕсли;
		ДатаНачала = Макс(СтрокаФонда.ДатаНачала, НачалоДня(ДатаОтбора));
		ДатаОкончания = Мин(СтрокаФонда.ДатаОкончания, КонецДня(ДатаОтбора));
		СтрокаФонда.ДлительностьЗаДень = Макс(0, ДатаОкончания - ДатаНачала);
	КонецЦикла;
	Фонд.Свернуть("Пользователь", "ДлительностьЗаНеделю, ДлительностьЗаДень");
	
	ИтогВсегоЗаНеделюСек = 0;
	ИтогРабочееЗаНеделюСек = 0;
	ИтогФондЗаНеделюСек = 0;
	ИтогВсегоЗаДеньСек = 0;
	ИтогРабочееЗаДеньСек = 0;
	ИтогФондЗаДеньСек = 0;
	
	Выборка.Сбросить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Строка = ТаблицаОтчетов.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		
		// Ежедневный отчет.
		Если ЗначениеЗаполнено(Выборка.ЕжедневныйОтчет) Тогда
			
			Строка.ВсегоЗаДень = Выборка.ЕжедневныйОтчетДлительностьРабот;
			ВсегоЗаДеньСек = УчетВремениКлиентСервер.ЧислоИзСтроки(Выборка.ЕжедневныйОтчетДлительностьРабот);
			ИтогВсегоЗаДеньСек = ИтогВсегоЗаДеньСек + ВсегоЗаДеньСек;
			
			Строка.РабочееЗаДень = Выборка.ЕжедневныйОтчетДлительностьРабочая;
			РабочееЗаДеньСек = УчетВремениКлиентСервер.ЧислоИзСтроки(Выборка.ЕжедневныйОтчетДлительностьРабочая);
			ИтогРабочееЗаДеньСек = ИтогРабочееЗаДеньСек + РабочееЗаДеньСек;
			
			СтрокаФонда = Фонд.Найти(Выборка.Пользователь);
			ФондЗаДеньСек = ?(СтрокаФонда = Неопределено, 0, СтрокаФонда.ДлительностьЗаДень);
			ПроцентФондаЗаДень = ?(ФондЗаДеньСек = 0, 0, РабочееЗаДеньСек / ФондЗаДеньСек * 100);
			Строка.ПроцентФондаЗаДень = Формат(ПроцентФондаЗаДень, "ЧДЦ=0; ЧН=0; ЧГ=0") + "%";
			ИтогФондЗаДеньСек = ИтогФондЗаДеньСек + ФондЗаДеньСек;
			
		Иначе
			Строка.ВсегоЗаДень = НСтр("ru = 'нет'");
			Строка.РабочееЗаДень = НСтр("ru = 'нет'");
			Строка.ПроцентФондаЗаДень = НСтр("ru = 'нет'");
		КонецЕсли;
		
		// Отчет за неделю.
		Если ЗначениеЗаполнено(Выборка.ЕженедельныйОтчет) Тогда
			
			Строка.ВсегоЗаНеделю = Выборка.ЕженедельныйОтчетДлительностьРабот;
			ВсегоЗаНеделюСек = УчетВремениКлиентСервер.ЧислоИзСтроки(Выборка.ЕженедельныйОтчетДлительностьРабот);
			ИтогВсегоЗаНеделюСек = ИтогВсегоЗаНеделюСек + ВсегоЗаНеделюСек;
			
			Строка.РабочееЗаНеделю = Выборка.ЕженедельныйОтчетДлительностьРабочая;
			РабочееЗаНеделюСек = УчетВремениКлиентСервер.ЧислоИзСтроки(Выборка.ЕженедельныйОтчетДлительностьРабочая);
			ИтогРабочееЗаНеделюСек = ИтогРабочееЗаНеделюСек + РабочееЗаНеделюСек;
			
			СтрокаФонда = Фонд.Найти(Выборка.Пользователь);
			ФондЗаНеделюСек = ?(СтрокаФонда = Неопределено, 0, СтрокаФонда.ДлительностьЗаНеделю);
			ПроцентФондаЗаНеделю = ?(ФондЗаНеделюСек = 0, 0, РабочееЗаНеделюСек / ФондЗаНеделюСек * 100);
			Строка.ПроцентФондаЗаНеделю = Формат(ПроцентФондаЗаНеделю, "ЧДЦ=0; ЧН=0; ЧГ=0") + "%";
			ИтогФондЗаНеделюСек = ИтогФондЗаНеделюСек + ФондЗаНеделюСек;
			
		Иначе
			Строка.ВсегоЗаНеделю = НСтр("ru = 'нет'");
			Строка.РабочееЗаНеделю = НСтр("ru = 'нет'");
			Строка.ПроцентФондаЗаНеделю = НСтр("ru = 'нет'");
		КонецЕсли;
		
		// Отсутствие.
		Если ПолучатьОтсутствия Тогда
			СтрокаОтсутствия = ТаблицаОтсутствий.Найти(Выборка.Пользователь, "Сотрудник");
			Если СтрокаОтсутствия <> Неопределено Тогда
				Строка.Отсутствие = СтрокаОтсутствия.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ИтогВсегоЗаНеделю = УчетВремениКлиентСервер.ЧислоВСтроку(ИтогВсегоЗаНеделюСек, "нет");
	ИтогРабочееЗаНеделю = УчетВремениКлиентСервер.ЧислоВСтроку(ИтогРабочееЗаНеделюСек, "нет");
	ИтогПроцентФондаЗаНеделю = ?(ИтогФондЗаНеделюСек = 0, НСтр("ru = 'нет'"),
		Формат(100 * ИтогРабочееЗаНеделюСек / ИтогФондЗаНеделюСек, "ЧДЦ=0; ЧН=нет; ЧГ=0") + "%");
		
	ИтогВсегоЗаДень = УчетВремениКлиентСервер.ЧислоВСтроку(ИтогВсегоЗаДеньСек, "нет");
	ИтогРабочееЗаДень = УчетВремениКлиентСервер.ЧислоВСтроку(ИтогРабочееЗаДеньСек, "нет");
	ИтогПроцентФондаЗаДень = ?(ИтогФондЗаДеньСек = 0, НСтр("ru = 'нет'"),
		Формат(100 * ИтогРабочееЗаДеньСек / ИтогФондЗаДеньСек, "ЧДЦ=0; ЧН=нет; ЧГ=0") + "%");
	
КонецПроцедуры

&НаСервере
Процедура МК_НастроитьЭлементыФормы()
	
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	СворачиваниеЭлементовПоВажности = СворачиваниеЭлементовФормыПоВажности.НеИспользовать;
	ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	
	Элементы.ТаблицаОбщаяКомандаОбсуждения.Видимость = Ложь;
	Элементы.СписокОбщаяКомандаОбсуждения.Видимость = Ложь;
	Элементы.ТаблицаОбщаяКомандаСоздатьПисьмоНаОсновании.Видимость = Ложь;
	Элементы.СписокОбщаяКомандаСоздатьПисьмоНаОсновании.Видимость = Ложь;
	
	Элементы.ГруппаКалендарьОтчеты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	// ДатаОтбора.
	Элементы.ДатаОтбораПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	Элементы.ДатаОтбораПолеВвода.Заголовок = НСтр("ru = 'Сведения на дату'");
	Элементы.ДатаОтбораПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	Элементы.ДатаОтбораПолеВвода.Видимость = Истина;
	
	Элементы.ДатаОтбора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элементы.ДатаОтбора.Видимость = Ложь;
	Элементы.ДатаОтбора.ОтображатьТекущуюДату = Ложь;
	
	// Список отчетов.
	Элементы.СписокОтчетов.Шапка = Ложь;
	Элементы.СписокОтчетовТип.Видимость = Ложь;
	Элементы.СписокОтчетовСправа.Видимость = Ложь;
	
	Элементы.СписокОтчетовПользователь.ЦветТекста = ЦветаСтиля.МК_ЦветАвтораИсполнителя;
	Элементы.СписокОтчетовПользователь.Шрифт = ШрифтыСтиля.МК_ШрифтАвтораИсполнителя;
	Элементы.СписокОтчетовДата.Формат = НСтр("ru='ДФ=''dd MMMM yyyy'''");
	
	Элементы.МК_СписокОтчетовГруппаКолонок.Видимость = Истина;
	
	Элементы.Переместить(Элементы.СписокОтчетовДата, Элементы.ГруппаДатаСотрудник);
	Элементы.Переместить(Элементы.СписокОтчетовПользователь, Элементы.ГруппаДатаСотрудник);
	Элементы.Переместить(Элементы.СписокОтчетовДлительностьРабот, Элементы.ГруппаДлительность);
	Элементы.Переместить(Элементы.СписокОтчетовДлительностьРабочая, Элементы.ГруппаДлительность);
	
	Элементы.СписокОтчетовПользователь.Высота = 2;
	
	// Контроль по датам.
	Элементы.Отчеты.Шапка = Ложь;
	Элементы.Отчеты.Подвал = Ложь;
	Элементы.ОтчетыПроцентФондаЗаНеделю.Видимость = Ложь;
	Элементы.ОтчетыДень.Видимость = Ложь;
	Элементы.Отсутствие.Видимость = Ложь;
	
	Элементы.ОтчетыНеделя.Группировка = ГруппировкаКолонок.Вертикальная;
	Элементы.Пользователь.Высота = 2;
	Элементы.Пользователь.РастягиватьПоГоризонтали = Истина;
	Элементы.ОтчетыНеделя.ФиксацияВТаблице = ФиксацияВТаблице.Право;
	Элементы.ОтчетыНеделя.Ширина = 8;
	
	ПриИзмененииПараметровЭкранаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПараметровЭкранаНаСервере()
	
	ЭтоМобильныйСБольшимЭкраном = МобильныйКлиентВызовСервера.ЭтоМобильныйСБольшимЭкраном();
	ЭтоМобильныйВПортретномРежиме = МобильныйКлиентВызовСервера.ЭтоМобильныйВПортретномРежиме();
	
	Если ЭтоМобильныйСБольшимЭкраном И Не ЭтоМобильныйВПортретномРежиме Тогда
		МК_НастроитьФормуВАльбомномРежиме();
	Иначе
		МК_НастроитьФормуВПортретномРежиме();
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура МК_НастроитьФормуВПортретномРежиме()
	
	Элементы.ГруппаКалендарьОтчеты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы.ДатаОтбора.Видимость = Ложь;
	Элементы.ДатаОтбораПолеВвода.Видимость = Истина;

КонецПроцедуры

&НаСервере
Процедура МК_НастроитьФормуВАльбомномРежиме()
	
	Элементы.ГруппаКалендарьОтчеты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Элементы.ДатаОтбора.Видимость = Истина;
	Элементы.ДатаОтбораПолеВвода.Видимость = Ложь;

КонецПроцедуры

#КонецОбласти
